//Дана строка. Если в этой строке более одного символа, выведите в консоль предпоследний символ этой строки.

// const str = "lalalalal";
// console.log(str[str.length - 2]);

//Даны два целых числа. Проверьте, что первое число без остатка делится на второе.
// let n = 4;
// let m = 2;
// if (n % m === 0) {
//   console.log("Yes");
// } else {
//   console.log("No");
// }

//Выведите в консоль все целые числа от 1 до 100.

// for (let i = 1; i <= 100; i++) {
//   console.log(i);
// }

//Выведите в консоль все целые числа от -100 до 0.

// for (let i = -100; i <= 0; i++) {
//   console.log(i);
// }

//Выведите в консоль все целые числа от 100 до 1.
// for (let i = 100; i >= 1; i--) {
//     console.log(i);
// }

//Выведите в консоль все четные числа из промежутка от 1 до 100.

// for (let i = 1; i <= 100; i++) {
//     if (i % 2 === 0) {
//         console.log(i);
//     }
// }

//Выведите в консоль все числа кратные трем в промежутке от 1 до 100.
// for (let i = 1; i <= 100; i++) {
//     if (i % 3 === 0) {
//         console.log(i);
//     }
// }

//Найдите сумму всех целых чисел от 1 до 100.
// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//     sum += i;
// }
// console.log(sum);

//Найдите сумму всех целых четных чисел в промежутке от 1 до 100.
// let sum = 0;
// for (let i = 2; i <= 100; i += 2) {
//     sum += i;
// }
// console.log(sum);

//Найдите сумму всех целых нечетных чисел в промежутке от 1 до 100.
// let sum = 0;
// for (let i = 1; i <= 100; i += 2) {
//   sum += i;
// }
// console.log(sum);

//Даны два целых числа. Найдите остаток от деления первого числа на второе.
// let x = 9;
// let y = 5;
// let n = x % y;
// console.log(n);

//Дана некоторая строка. Переберите и выведите в консоль по очереди все символы с конца строки.
// let str = "Adelina";

// for (let i = str.length - 1; i >= 0; i--) {
//   console.log(str[i]);
// }
